<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Arduino IDE and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.eps-autopkg-recipes.munki.arduino</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>64bit</string>
		<key>NAME</key>
		<string>arduino</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/arduino</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A fast and powerful programming tool.</string>
			<key>display_name</key>
			<string>Arduino IDE</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
			<key>blocking_applications</key>
			<array>
				<string>Arduino</string>
        <string>Arduino IDE</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.eps-autopkg-recipes.download.arduino</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
