<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of SuperCollider

    Set the ARCHITECTURE variable to "universal" for universal
    </string>
    <key>Identifier</key>
    <string>com.github.eps-autopkg-recipes.download.supercollider</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SuperCollider</string>
        <key>ARCHITECTURE</key>
        <string>universal</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>SuperCollider-(\d(\.\d*)+)-macOS-%ARCHITECTURE%\.dmg</string>
                <key>github_repo</key>
                <string>supercollider/supercollider</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/SuperCollider.app</string>
                <key>requirement</key>
                <string>identifier "net.sourceforge.supercollider" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HE5VJFE9E4</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
