<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Privileges.app and imports it into Munki</string>
    <key>Identifier</key>
    <string>com.github.eps-autopkg-recipes.munki.privileges</string>
    <key>Input</key>
    <dict>
        <key>DESCRIPTION</key>
        <string>Privileges.app for macOS is designed to allow users to work as a standard user for day-to-day use, by providing a quick and easy way to get administrator rights when needed. When you do need admin rights, you can get them by clicking on the Privileges icon in your Dock.</string>
        <key>DISPLAYNAME</key>
        <string>Privileges</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>SAP</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string></string>
        <key>NAME</key>
        <string>Privileges</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>%DESCRIPTION%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%DISPLAYNAME%</string>
            <key>minimum_os_version</key>
            <string>10.12</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash

if [[ -f "/Library/LaunchDaemons/corp.sap.privileges.helper.plist" ]]; then
    launchctl unload "/Library/LaunchDaemons/corp.sap.privileges.helper.plist" 2&gt;/dev/null
    rm -rf "/Library/LaunchDaemons/corp.sap.privileges.helper.plist"
fi

rm -rf "/Applications/Privileges.app"
rm -rf "/Library/PrivilegedHelperTools/corp.sap.privileges.helper"
pkgutil --forget com.sap.privileges
</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.privileges</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/Privileges.app</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Privileges.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/</string>                    
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
